tap "felixkratz/formulae"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "jstkdng/programs"
tap "koekeishiya/formulae"
tap "ngrok/ngrok"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "sst/tap"
# Run your GitHub Actions locally
brew "act"
# GNU compiler collection for arm-none-eabi
brew "arm-none-eabi-gcc"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Securely send things from one computer to another
brew "croc"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modern, maintained replacement for ls
brew "eza"
# Easiest way to build and release mobile apps
brew "fastlane"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Audit git repos for secrets
brew "gitleaks"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Load testing and performance measurement application
brew "jmeter"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Library to talk to FTDI chips
brew "libftdi"
# Next-gen compiler infrastructure
brew "llvm"
# Powerful, lightweight programming language
brew "lua"
# Mac App Store command-line interface
brew "mas"
# Atlas CLI enables you to manage your MongoDB Atlas
brew "mongodb-atlas-cli"
# QUIC transport protocol implementation
brew "mvfst"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Terminal multiplexer
brew "tmux"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Prompt theme engine for any shell
brew "jandedobbeleer/oh-my-posh/oh-my-posh", link: false
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
# Drop in replacement for ueberzug written in C++
brew "jstkdng/programs/ueberzugpp"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Enable Windows-like alt-tab
cask "alt-tab"
# Chromium based browser
cask "arc"
# Web security testing toolkit
cask "burp-suite"
# Launch builds and start simulators from your menu bar
cask "expo-orbit"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
# Finder replacement and FTP, SFTP, WebDAV and Amazon s3 client
cask "forklift"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Find shortcuts for any installed application
cask "keyclu"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Mouse control with the keyboard
cask "mouseless@preview"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# Standalone app for debugging React Native apps
cask "react-native-debugger"
# App that enables mouse-free UI interaction
cask "shortcat"
# PDF reader and note-taking application
cask "skim"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# LaTeX editor
cask "texstudio"
# Easy to use text extraction tool
cask "trex"
# Run commands and display their output on the desktop
cask "ubersicht"
# Open-source code editor
cask "visual-studio-code@insiders"
# Rust-based terminal
cask "warp"
mas "Bitwarden", id: 1352778147
mas "Color Picker", id: 1545870783
mas "Developer", id: 640199958
mas "File Viewer", id: 495987613
mas "GarageBand", id: 682658836
mas "Key Codes", id: 414568915
mas "Kindle", id: 302584613
mas "Magnet", id: 441258766
mas "Microsoft Outlook", id: 985367838
mas "Paint S", id: 736473980
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
vscode "akiramiyakoda.cppincludeguard"
vscode "asvetliakov.vscode-neovim"
vscode "docker.docker"
vscode "marus25.cortex-debug"
vscode "mcu-debug.debug-tracker-vscode"
vscode "mcu-debug.memory-view"
vscode "mcu-debug.peripheral-viewer"
vscode "mcu-debug.rtos-views"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.vscode-serial-monitor"
vscode "paulober.pico-w-go"
vscode "raspberry-pi.raspberry-pi-pico"
vscode "twxs.cmake"
